[
    {
        "id": "proj0001",
        "nomFr": "Toxic City",
        "nomEn": "Toxic City",
        "contribFr": "Gestion, mécaniques de jeu, C#, art pixelisé, intégration",
        "contribEn": "Management, game mechanics, C#, pixel art, integration",
        "descriptFr": "Projet dans lequel j'ai appris le travail de directeur technique et à avoir une vision globale d'un projet de jeu. J'ai appris à travailler avec Trello pour distribuer les tâches et j'ai appris à développer les mécaniques pour un RPG tour-par-tour.",
        "descriptEn": "In this project, I learned the rudiments of a chief of technical operations' work and to have a good global vision of a video game project. I also learned to work with Trello to distribute tasks, and learned how to make the mechanics for a turn-by-turn RPG.",
        "url": "https://toxiccity.netlify.app",
        "git": "https://github.com/Xunrae/ToxicCodes",
        "build": "https://drive.google.com/file/d/1_3g0D9p8v5Ko9Xgd4P2j4EsorQE8xjl-/view?usp=sharing"
    },
    {
        "id": "proj0002",
        "nomFr": "Puppet Master",
        "nomEn": "Puppet Master",
        "contribFr": "Art pixelisé, intégration",
        "contribEn": "Pixel art, integration",
        "descriptFr": "Jeu réalisé pour le GameJam de Valleyfield en janvier 2021. Ce projet m'a permis de mieux gérer mon temps et accepter de faire des compromis sur le travail à effectuer pour respecter les échéanciers. J'ai aussi appris à faire un jeu en 2.5D dans Unity et à changer les shaders des sprites pour afficher des ombres.",
        "descriptEn": "Game made for the GameJam of Valleyfield in january 2021. This project made me get a better grip on my time management and made me accept to compromise on tasks to respect the deadlines. I also learned how to make a 2.5D game in Unity and how to change shaders to allow sprites to have shadows.",
        "url": "https://csharkspuppetmaster.netlify.app",
        "git": "",
        "build": "https://drive.google.com/file/d/1SqT8uvD3z6Cca1z0NlarjPrPwepUp5Si/view?usp=sharing"
    },
    {
        "id": "proj0003",
        "nomFr": "Projet de réalité virtuelle",
        "nomEn": "Virtual reality project",
        "contribFr": "Mécaniques de jeu, C#, intégration",
        "contribEn": "Game mechanics, C#, integration",
        "descriptFr": "Environnement intéractif dans lequel j'ai appris les rudiments de la création d'un jeu en RV dans Unity.",
        "descriptEn": "Interactive environment in which I learned the basics of making a VR game in Unity.",
        "url": "",
        "git": "",
        "build": "https://drive.google.com/file/d/1g6QRmzxCYlZ-ghiA2KWUwWMFVKlFu16U/view?usp=sharing"
    },
    {
        "id": "proj0004",
        "nomFr": "Helicoptère",
        "nomEn": "Helicopter",
        "contribFr": "Mécaniques de jeu, C#, intégration",
        "contribEn": "Game mechanics, C#, integration",
        "descriptFr": "Dans cet exercice, j'ai appris à programmer dans un environnement 3D, rajouter des mécaniques et des effets de particules sur des objets à distance, contrôler plusieurs caméras, créer un terrain 3D dans unity avec des assets importés, changer les textures et beaucoup de notions de programmation intermédiaires en C#. Ces acquis ont approfondi à la fois ma capacité d'intégration et de programmation.",
        "descriptEn": "In this exercise, I learned how to program in a 3D environment, how to add mechanics and particle effects to distant objects, control multiple cameras, create a 3D terrain using Unity with imported assets, change textures and a good deal of intermediate C# notions. Those notions gave me deeper knowledge of both programming and integration.",
        "url": "",
        "git": "https://github.com/Xunrae/CopterCodes",
        "build": "https://drive.google.com/drive/folders/1foH_1QJC62TtO8LakX_TVt2B8Zamz0wz?usp=sharing"
    },
    {
        "id": "proj0005",
        "nomFr": "Exile Démoniaque",
        "nomEn": "Demonic Exile",
        "contribFr": "Mécaniques de jeu, C#, intégration",
        "contribEn": "Game mechanics, C#, integration",
        "descriptFr": "Projet dans lequel j'ai appris à intégrer divers éléments dans Unity, assembler, lier et programmer des animations, utiliser les mécaniques de Unity, changer de scènes, instantier des objets, ajuster des variables globales, afficher un UI, etc. Cette expérience m'a donné beaucoup d'outils nécessaires au métier d'intégrateur en jeux 2D.",
        "descriptEn": "Project in which I learned to integrate diverse elements in Unity, assemble, link and program animations, use Unity's built-in mechanics, change scenes, instantiate objects, adjust global variables, show an UI, etc. This experience gave me alot of tools to become a 2D game integrator.",
        "url": "",
        "git": "https://github.com/Xunrae/demonicExile",
        "build": "https://drive.google.com/file/d/1u0wSouqKolMyzhB3c8I1guWxieiSthlq/view?usp=sharing"
    }
]