[
    {
        "id": "proj0001",
        "nomFr": "Toxic City",
        "nomEn": "Toxic City",
        "descriptFr": "Dans ce travail, j'ai appris les rudiments du travail de directeur technique et à me faire une vision globale d'un projet de jeu, incluant échéanciers. J'ai aussi appris à travailler avec Trello pour distribuer les tâches à mes équipiers, et à développer les mécaniques de base pour un RPG tour-par-tour. Cette expérience va me servir à faire des choix éclairés dans mes échéanciers, à garder une vue d'ensemble sur les projets à développer et à bien gérer mon temps et celui des autres, au besoin.",
        "descriptEn": "",
        "url": "https://toxiccity.netlify.app"
    },
    {
        "id": "proj0002",
        "nomFr": "Puppet Master",
        "nomEn": "Puppet Master",
        "descriptFr": "Jeu réalisé pour le GameJam de Valleyfield en janvier 2021. Ce projet m'a appris à mieux gérer mon temps et à faire des compromis sur le travail qui est à effectuer pour respecter les échéanciers. J'ai aussi appris à faire un jeu en 2.5D dans Unity et à changer les shaders des sprites pour afficher des ombres. Dans l'avenir, ceci me permettra de bien communiquer rapidement mon avis sur ce qui est faisable dans le temps imparti, et de faire le bon choix sur les mécaniques qui peuvent être optionnelles.",
        "descriptEn": "",
        "url": "https://csharkspuppetmaster.netlify.app"
    },
    {
        "id": "proj0003",
        "nomFr": "Projet RV",
        "nomEn": "VR project",
        "descriptFr": "Environnement intéractif dans lequel j'ai appris les rudiments de la création d'un jeu en RV dans Unity.",
        "descriptEn": "Interactive environment in which I learned the basics of making a VR game in Unity.",
        "url": ""
    },
    {
        "id": "proj0004",
        "nomFr": "Helicoptère",
        "nomEn": "Helicopter",
        "descriptFr": "Dans cet exercice, j'ai appris à programmer dans un environnement 3D, rajouter des mécaniques et des effets de particules sur des objets à distance, contrôler plusieurs caméras, créer un terrain 3D dans unity avec des assets importés, changer les textures et beaucoup de notions de programmation intermédiaires en C#. Ces acquis ont approfondi à la fois ma capacité d'intégration et de programmation.",
        "descriptEn": "",
        "url": "https://drive.google.com/drive/folders/1foH_1QJC62TtO8LakX_TVt2B8Zamz0wz?usp=sharing"
    },
    {
        "id": "proj0005",
        "nomFr": "Exile Démoniaque",
        "nomEn": "Demonic Exile",
        "descriptFr": "Projet dans lequel j'ai appris à intégrer divers éléments dans Unity, assembler, lier et programmer des animations, utiliser les mécaniques de Unity (colliders, gravité, contraintes, etc), changer de scènes, instantier des objets, ajuster des variables globales, afficher un UI, etc. Cette expérience m'a donné beaucoup d'outils nécessaires au métier d'intégrateur en jeux 2D.",
        "descriptEn": "",
        "url": "https://drive.google.com/file/d/1u0wSouqKolMyzhB3c8I1guWxieiSthlq/view?usp=sharing"
    }
]